
function convert_scripts(input_str) {
    var script_map = {}
    script_map['bangali'] = {
        '\u0980': 'ऀ', '\u0981': 'ँ', '\u0982': 'ं', '\u0983': 'ः', '\u0985': 'अ',
        '\u0986': 'आ', '\u0987': 'इ', '\u0988': 'ई', '\u0989': 'उ', '\u098A': 'ऊ',
        '\u098B': 'ऋ', '\u098C': 'ऌ', '\u098F': 'ए', '\u0990': 'ऐ', '\u0993': 'ओ',
        '\u0994': 'औ', '\u0995': 'क', '\u0996': 'ख', '\u0997': 'ग', '\u0998': 'घ',
        '\u0999': 'ङ', '\u099A': 'च', '\u099B': 'छ', '\u099C': 'ज', '\u099D': 'झ',
        '\u099E': 'ञ', '\u099F': 'ट', '\u09A0': 'ठ', '\u09A1': 'ड', '\u09A2': 'ढ',
        '\u09A3': 'ण', '\u09A4': 'त', '\u09A5': 'थ', '\u09A6': 'द', '\u09A7': 'ध',
        '\u09A8': 'न', '\u09AA': 'प', '\u09AB': 'फ', '\u09AC': 'ब', '\u09AD': 'भ',
        '\u09AE': 'म', '\u09AF': 'य', '\u09B0': 'र', '\u09B2': 'ल', '\u09B6': 'श',
        '\u09B7': 'ष', '\u09B8': 'स', '\u09B9': 'ह', '\u09BC': '़', '\u09BD': 'ऽ',
        '\u09BE': 'ा', '\u09BF': 'ि', '\u09C0': 'ी', '\u09C1': 'ु', '\u09C2': 'ू',
        '\u09C3': 'ृ', '\u09C4': 'ॄ', '\u09C7': 'े', '\u09C8': 'ै', '\u09CB': 'ो',
        '\u09CC': 'ौ', '\u09CD': '्', '\u09CE': 'त्', '\u09D7': 'ौ', '\u09DC': 'ड़',
        '\u09DD': 'ढ़', '\u09DF': 'य़', '\u09E0': 'ॠ', '\u09E1': 'ॡ', '\u09E2': 'ॢ',
        '\u09E3': 'ॣ', '\u09E6': '०', '\u09E7': '१', '\u09E8': '२', '\u09E9': '३',
        '\u09EA': '४', '\u09EB': '५', '\u09EC': '६', '\u09ED': '७', '\u09EE': '८',
        '\u09EF': '९', '\u09F0': 'र', '\u09F1': 'व', '\u09F2': '₹', '\u09F3': '₹',
        '\u09F4': '१', '\u09F5': '२', '\u09F6': '३', '\u09F7': '४', '\u09F8': '३',
        '\u09F9': '०', '\u09FA': 'ॐ', '\u09FB': '।', '\u09FC': 'ँ', '\u09FD': 'ऽ',
        '\u09FE': '॥'
    }
    script_map['gurumukhi'] = {
        '\u0A01': 'ँ', '\u0A02': 'ं', '\u0A03': 'ः', '\u0A05': 'अ', '\u0A06': 'आ',
        '\u0A07': 'इ', '\u0A08': 'ई', '\u0A09': 'उ', '\u0A0A': 'ऊ', '\u0A0F': 'ए',
        '\u0A10': 'ऐ', '\u0A13': 'ओ', '\u0A14': 'औ', '\u0A15': 'क', '\u0A16': 'ख',
        '\u0A17': 'ग', '\u0A18': 'घ', '\u0A19': 'ङ', '\u0A1A': 'च', '\u0A1B': 'छ',
        '\u0A1C': 'ज', '\u0A1D': 'झ', '\u0A1E': 'ञ', '\u0A1F': 'ट', '\u0A20': 'ठ',
        '\u0A21': 'ड', '\u0A22': 'ढ', '\u0A23': 'ण', '\u0A24': 'त', '\u0A25': 'थ',
        '\u0A26': 'द', '\u0A27': 'ध', '\u0A28': 'न', '\u0A2A': 'प', '\u0A2B': 'फ',
        '\u0A2C': 'ब', '\u0A2D': 'भ', '\u0A2E': 'म', '\u0A2F': 'य', '\u0A30': 'र',
        '\u0A32': 'ल', '\u0A33': 'ळ', '\u0A35': 'व', '\u0A36': 'श', '\u0A38': 'स',
        '\u0A39': 'ह', '\u0A3C': '़', '\u0A3E': 'ा', '\u0A3F': 'ि', '\u0A40': 'ी',
        '\u0A41': 'ु', '\u0A42': 'ू', '\u0A47': 'े', '\u0A48': 'ै', '\u0A4B': 'ो',
        '\u0A4C': 'ौ', '\u0A4D': '्', '\u0A51': '॑', '\u0A59': 'ख़', '\u0A5A': 'ग़',
        '\u0A5B': 'ज़', '\u0A5C': 'ड़', '\u0A5E': 'फ़', '\u0A66': '०', '\u0A67': '१',
        '\u0A68': '२', '\u0A69': '३', '\u0A6A': '४', '\u0A6B': '५', '\u0A6C': '६',
        '\u0A6D': '७', '\u0A6E': '८', '\u0A6F': '९', '\u0A70': 'ं', '\u0A71': '्',
        '\u0A72': 'इ', '\u0A73': 'उ', '\u0A74': 'ॐ', '\u0A75': '्य', '\u0A76': '॰'
    };
    script_map['gujarati'] = {
        '\u0A81': 'ँ', '\u0A82': 'ं', '\u0A83': 'ः', '\u0A85': 'अ', '\u0A86': 'आ',
        '\u0A87': 'इ', '\u0A88': 'ई', '\u0A89': 'उ', '\u0A8A': 'ऊ', '\u0A8B': 'ऋ',
        '\u0A8C': 'ऌ', '\u0A8D': 'ऍ', '\u0A8F': 'ए', '\u0A90': 'ऐ', '\u0A91': 'ऑ',
        '\u0A93': 'ओ', '\u0A94': 'औ', '\u0A95': 'क', '\u0A96': 'ख', '\u0A97': 'ग',
        '\u0A98': 'घ', '\u0A99': 'ङ', '\u0A9A': 'च', '\u0A9B': 'छ', '\u0A9C': 'ज',
        '\u0A9D': 'झ', '\u0A9E': 'ञ', '\u0A9F': 'ट', '\u0AA0': 'ठ', '\u0AA1': 'ड',
        '\u0AA2': 'ढ', '\u0AA3': 'ण', '\u0AA4': 'त', '\u0AA5': 'थ', '\u0AA6': 'द',
        '\u0AA7': 'ध', '\u0AA8': 'न', '\u0AAA': 'प', '\u0AAB': 'फ', '\u0AAC': 'ब',
        '\u0AAD': 'भ', '\u0AAE': 'म', '\u0AAF': 'य', '\u0AB0': 'र', '\u0AB2': 'ल',
        '\u0AB3': 'ळ', '\u0AB5': 'व', '\u0AB6': 'श', '\u0AB7': 'ष', '\u0AB8': 'स',
        '\u0AB9': 'ह', '\u0ABC': '़', '\u0ABD': 'ऽ', '\u0ABE': 'ा', '\u0ABF': 'ि',
        '\u0AC0': 'ी', '\u0AC1': 'ु', '\u0AC2': 'ू', '\u0AC3': 'ृ', '\u0AC4': 'ॄ',
        '\u0AC5': 'ॅ', '\u0AC7': 'े', '\u0AC8': 'ै', '\u0AC9': 'ॉ', '\u0ACB': 'ो',
        '\u0ACC': 'ौ', '\u0ACD': '्', '\u0AD0': 'ॐ', '\u0AE0': 'ॠ', '\u0AE1': 'ॡ',
        '\u0AE2': 'ॢ', '\u0AE3': 'ॣ', '\u0AE6': '०', '\u0AE7': '१', '\u0AE8': '२',
        '\u0AE9': '३', '\u0AEA': '४', '\u0AEB': '५', '\u0AEC': '६', '\u0AED': '७',
        '\u0AEE': '८', '\u0AEF': '९', '\u0AF0': '॰', '\u0AF1': '₹', '\u0AF9': 'ज़',
        '\u0AFA': '्', '\u0AFB': '्', '\u0AFC': 'ऽ', '\u0AFD': '़', '\u0AFE': '़',
        '\u0AFF': '़'
    };
    script_map['udiya'] = {
        '\u0B01': 'ँ', '\u0B02': 'ं', '\u0B03': 'ः', '\u0B05': 'अ', '\u0B06': 'आ',
        '\u0B07': 'इ', '\u0B08': 'ई', '\u0B09': 'उ', '\u0B0A': 'ऊ', '\u0B0B': 'ऋ',
        '\u0B0C': 'ऌ', '\u0B0F': 'ए', '\u0B10': 'ऐ', '\u0B13': 'ओ', '\u0B14': 'औ',
        '\u0B15': 'क', '\u0B16': 'ख', '\u0B17': 'ग', '\u0B18': 'घ', '\u0B19': 'ङ',
        '\u0B1A': 'च', '\u0B1B': 'छ', '\u0B1C': 'ज', '\u0B1D': 'झ', '\u0B1E': 'ञ',
        '\u0B1F': 'ट', '\u0B20': 'ठ', '\u0B21': 'ड', '\u0B22': 'ढ', '\u0B23': 'ण',
        '\u0B24': 'त', '\u0B25': 'थ', '\u0B26': 'द', '\u0B27': 'ध', '\u0B28': 'न',
        '\u0B2A': 'प', '\u0B2B': 'फ', '\u0B2C': 'ब', '\u0B2D': 'भ', '\u0B2E': 'म',
        '\u0B2F': 'य', '\u0B30': 'र', '\u0B32': 'ल', '\u0B33': 'ळ', '\u0B35': 'व',
        '\u0B36': 'श', '\u0B37': 'ष', '\u0B38': 'स', '\u0B39': 'ह', '\u0B3C': '़',
        '\u0B3D': 'ऽ', '\u0B3E': 'ा', '\u0B3F': 'ि', '\u0B40': 'ी', '\u0B41': 'ु',
        '\u0B42': 'ू', '\u0B43': 'ृ', '\u0B44': 'ॄ', '\u0B47': 'े', '\u0B48': 'ै',
        '\u0B4B': 'ो', '\u0B4C': 'ौ', '\u0B4D': '्', '\u0B55': 'ॅ', '\u0B56': 'ै',
        '\u0B57': 'ौ', '\u0B5C': 'ड़', '\u0B5D': 'ढ़', '\u0B5F': 'य़', '\u0B60': 'ॠ',
        '\u0B61': 'ॡ', '\u0B62': 'ॢ', '\u0B63': 'ॣ', '\u0B66': '०', '\u0B67': '१',
        '\u0B68': '२', '\u0B69': '३', '\u0B6A': '४', '\u0B6B': '५', '\u0B6C': '६',
        '\u0B6D': '७', '\u0B6E': '८', '\u0B6F': '९', '\u0B70': 'ॐ', '\u0B71': 'व',
        '\u0B72': '१', '\u0B73': '२', '\u0B74': '३', '\u0B75': '०', '\u0B76': '०',
        '\u0B77': '०'
    };
    script_map['tamil'] = {
        '\u0B82': 'ं', '\u0B83': 'ः', '\u0B85': 'अ', '\u0B86': 'आ', '\u0B87': 'इ',
        '\u0B88': 'ई', '\u0B89': 'उ', '\u0B8A': 'ऊ', '\u0B8E': 'ऎ', '\u0B8F': 'ए',
        '\u0B90': 'ऐ', '\u0B92': 'ऒ', '\u0B93': 'ओ', '\u0B94': 'औ', '\u0B95': 'क',
        '\u0B99': 'ङ', '\u0B9A': 'च', '\u0B9C': 'ज', '\u0B9E': 'ञ', '\u0B9F': 'ट',
        '\u0BA3': 'ण', '\u0BA4': 'त', '\u0BA8': 'न', '\u0BA9': 'ऩ', '\u0BAA': 'प',
        '\u0BAE': 'म', '\u0BAF': 'य', '\u0BB0': 'र', '\u0BB1': 'ऱ', '\u0BB2': 'ल',
        '\u0BB3': 'ळ', '\u0BB4': 'ऴ', '\u0BB5': 'व', '\u0BB6': 'श', '\u0BB7': 'ष',
        '\u0BB8': 'स', '\u0BB9': 'ह', '\u0BBE': 'ा', '\u0BBF': 'ि', '\u0BC0': 'ी',
        '\u0BC1': 'ु', '\u0BC2': 'ू', '\u0BC6': 'ॆ', '\u0BC7': 'े', '\u0BC8': 'ै',
        '\u0BCA': 'ॊ', '\u0BCB': 'ो', '\u0BCC': 'ौ', '\u0BCD': '्', '\u0BD0': 'ॐ',
        '\u0BD7': 'ौ', '\u0BE6': '०', '\u0BE7': '१', '\u0BE8': '२', '\u0BE9': '३',
        '\u0BEA': '४', '\u0BEB': '५', '\u0BEC': '६', '\u0BED': '७', '\u0BEE': '८',
        '\u0BEF': '९', '\u0BF0': '१०', '\u0BF1': '१००', '\u0BF2': '१०००', '\u0BF3': 'दि',
        '\u0BF4': 'मा', '\u0BF5': 'व', '\u0BF6': 'ना', '\u0BF7': 'ज', '\u0BF8': '॰',
        '\u0BF9': 'रु', '\u0BFA': 'सं'
    };
    script_map['telugu'] = {
        '\u0C00': 'ऀ', '\u0C01': 'ँ', '\u0C02': 'ं', '\u0C03': 'ः', '\u0C04': 'ं',
        '\u0C05': 'अ', '\u0C06': 'आ', '\u0C07': 'इ', '\u0C08': 'ई', '\u0C09': 'उ',
        '\u0C0A': 'ऊ', '\u0C0B': 'ऋ', '\u0C0C': 'ऌ', '\u0C0E': 'ऎ', '\u0C0F': 'ए',
        '\u0C10': 'ऐ', '\u0C12': 'ऒ', '\u0C13': 'ओ', '\u0C14': 'औ', '\u0C15': 'क',
        '\u0C16': 'ख', '\u0C17': 'ग', '\u0C18': 'घ', '\u0C19': 'ङ', '\u0C1A': 'च',
        '\u0C1B': 'छ', '\u0C1C': 'ज', '\u0C1D': 'झ', '\u0C1E': 'ञ', '\u0C1F': 'ट',
        '\u0C20': 'ठ', '\u0C21': 'ड', '\u0C22': 'ढ', '\u0C23': 'ण', '\u0C24': 'त',
        '\u0C25': 'थ', '\u0C26': 'द', '\u0C27': 'ध', '\u0C28': 'न', '\u0C2A': 'प',
        '\u0C2B': 'फ', '\u0C2C': 'ब', '\u0C2D': 'भ', '\u0C2E': 'म', '\u0C2F': 'य',
        '\u0C30': 'र', '\u0C31': 'ऱ', '\u0C32': 'ल', '\u0C33': 'ळ', '\u0C34': 'ऴ',
        '\u0C35': 'व', '\u0C36': 'श', '\u0C37': 'ष', '\u0C38': 'स', '\u0C39': 'ह',
        '\u0C3C': '़', '\u0C3D': 'ऽ', '\u0C3E': 'ा', '\u0C3F': 'ि', '\u0C40': 'ी',
        '\u0C41': 'ु', '\u0C42': 'ू', '\u0C43': 'ृ', '\u0C44': 'ॄ', '\u0C46': 'ॆ',
        '\u0C47': 'े', '\u0C48': 'ै', '\u0C4A': 'ॊ', '\u0C4B': 'ो', '\u0C4C': 'ौ',
        '\u0C4D': '्', '\u0C55': 'ऽ', '\u0C56': 'ै', '\u0C58': 'च़', '\u0C59': 'ज़',
        '\u0C5A': 'ड़', '\u0C5C': 'श्री', '\u0C5D': 'न्', '\u0C60': 'ॠ', '\u0C61': 'ॡ',
        '\u0C62': 'ॢ', '\u0C63': 'ॣ', '\u0C66': '०', '\u0C67': '१', '\u0C68': '२',
        '\u0C69': '३', '\u0C6A': '४', '\u0C6B': '५', '\u0C6C': '६', '\u0C6D': '७',
        '\u0C6E': '८', '\u0C6F': '९', '\u0C77': 'ॐ', '\u0C78': '०', '\u0C79': '१',
        '\u0C7A': '२', '\u0C7B': '३', '\u0C7C': '१', '\u0C7D': '२', '\u0C7E': '३',
        '\u0C7F': '०'
    };
    script_map['kannada'] = {
        '\u0C80': 'ँ', '\u0C81': 'ँ', '\u0C82': 'ं', '\u0C83': 'ः', '\u0C84': 'ॐ',
        '\u0C85': 'अ', '\u0C86': 'आ', '\u0C87': 'इ', '\u0C88': 'ई', '\u0C89': 'उ',
        '\u0C8A': 'ऊ', '\u0C8B': 'ऋ', '\u0C8C': 'ऌ', '\u0C8E': 'ऎ', '\u0C8F': 'ए',
        '\u0C90': 'ऐ', '\u0C92': 'ऒ', '\u0C93': 'ओ', '\u0C94': 'औ', '\u0C95': 'क',
        '\u0C96': 'ख', '\u0C97': 'ग', '\u0C98': 'घ', '\u0C99': 'ङ', '\u0C9A': 'च',
        '\u0C9B': 'छ', '\u0C9C': 'ज', '\u0C9D': 'झ', '\u0C9E': 'ञ', '\u0C9F': 'ट',
        '\u0CA0': 'ठ', '\u0CA1': 'ड', '\u0CA2': 'ढ', '\u0CA3': 'ण', '\u0CA4': 'त',
        '\u0CA5': 'थ', '\u0CA6': 'द', '\u0CA7': 'ध', '\u0CA8': 'न', '\u0CAA': 'प',
        '\u0CAB': 'फ', '\u0CAC': 'ब', '\u0CAD': 'भ', '\u0CAE': 'म', '\u0CAF': 'य',
        '\u0CB0': 'र', '\u0CB1': 'ऱ', '\u0CB2': 'ल', '\u0CB3': 'ळ', '\u0CB5': 'व',
        '\u0CB6': 'श', '\u0CB7': 'ष', '\u0CB8': 'स', '\u0CB9': 'ह', '\u0CBC': '़',
        '\u0CBD': 'ऽ', '\u0CBE': 'ा', '\u0CBF': 'ि', '\u0CC0': 'ी', '\u0CC1': 'ु',
        '\u0CC2': 'ू', '\u0CC3': 'ृ', '\u0CC4': 'ॄ', '\u0CC6': 'ॆ', '\u0CC7': 'े',
        '\u0CC8': 'ै', '\u0CCA': 'ॊ', '\u0CCB': 'ो', '\u0CCC': 'ौ', '\u0CCD': '्',
        '\u0CD5': 'ऽ', '\u0CD6': 'ै', '\u0CDC': 'श्री', '\u0CDD': 'न्', '\u0CDE': 'फ़',
        '\u0CE0': 'ॠ', '\u0CE1': 'ॡ', '\u0CE2': 'ॢ', '\u0CE3': 'ॣ', '\u0CE6': '०',
        '\u0CE7': '१', '\u0CE8': '२', '\u0CE9': '३', '\u0CEA': '४', '\u0CEB': '५',
        '\u0CEC': '६', '\u0CED': '७', '\u0CEE': '८', '\u0CEF': '९', '\u0CF1': 'ᳵ',
        '\u0CF2': 'ᳶ', '\u0CF3': 'ं'
    };
    script_map['malayalam'] = {
        '\u0D00': 'ं', '\u0D01': 'ँ', '\u0D02': 'ं', '\u0D03': 'ः', '\u0D04': 'ँ',
        '\u0D05': 'अ', '\u0D06': 'आ', '\u0D07': 'इ', '\u0D08': 'ई', '\u0D09': 'उ',
        '\u0D0A': 'ऊ', '\u0D0B': 'ऋ', '\u0D0C': 'ऌ', '\u0D0E': 'ऎ', '\u0D0F': 'ए',
        '\u0D10': 'ऐ', '\u0D12': 'ऒ', '\u0D13': 'ओ', '\u0D14': 'औ', '\u0D15': 'क',
        '\u0D16': 'ख', '\u0D17': 'ग', '\u0D18': 'घ', '\u0D19': 'ङ', '\u0D1A': 'च',
        '\u0D1B': 'छ', '\u0D1C': 'ज', '\u0D1D': 'झ', '\u0D1E': 'ञ', '\u0D1F': 'ट',
        '\u0D20': 'ठ', '\u0D21': 'ड', '\u0D22': 'ढ', '\u0D23': 'ण', '\u0D24': 'त',
        '\u0D25': 'थ', '\u0D26': 'द', '\u0D27': 'ध', '\u0D28': 'न', '\u0D29': 'ऩ',
        '\u0D2A': 'प', '\u0D2B': 'फ', '\u0D2C': 'ब', '\u0D2D': 'भ', '\u0D2E': 'म',
        '\u0D2F': 'य', '\u0D30': 'र', '\u0D31': 'ऱ', '\u0D32': 'ल', '\u0D33': 'ळ',
        '\u0D34': 'ऴ', '\u0D35': 'व', '\u0D36': 'श', '\u0D37': 'ष', '\u0D38': 'स',
        '\u0D39': 'ह', '\u0D3A': 'ट', '\u0D3B': '्', '\u0D3C': '्', '\u0D3D': 'ऽ',
        '\u0D3E': 'ा', '\u0D3F': 'ि', '\u0D40': 'ी', '\u0D41': 'ु', '\u0D42': 'ू',
        '\u0D43': 'ृ', '\u0D44': 'ॄ', '\u0D46': 'ॆ', '\u0D47': 'े', '\u0D48': 'ै',
        '\u0D4A': 'ॊ', '\u0D4B': 'ो', '\u0D4C': 'ौ', '\u0D4D': '्', '\u0D4E': 'र्',
        '\u0D4F': 'प', '\u0D54': 'म्', '\u0D55': 'य्', '\u0D56': 'ऴ्', '\u0D57': 'ौ',
        '\u0D58': '०', '\u0D59': '०', '\u0D5A': '०', '\u0D5B': '०', '\u0D5C': '०',
        '\u0D5D': '०', '\u0D5E': '०', '\u0D5F': 'ई', '\u0D60': 'ॠ', '\u0D61': 'ॡ',
        '\u0D62': 'ॢ', '\u0D63': 'ॣ', '\u0D66': '०', '\u0D67': '१', '\u0D68': '२',
        '\u0D69': '३', '\u0D6A': '४', '\u0D6B': '५', '\u0D6C': '६', '\u0D6D': '७',
        '\u0D6E': '८', '\u0D6F': '९', '\u0D70': '१०', '\u0D71': '१००', '\u0D72': '१०००',
        '\u0D73': '१', '\u0D74': '२', '\u0D75': '३', '\u0D76': '०', '\u0D77': '०',
        '\u0D78': '०', '\u0D79': 'दि', '\u0D7A': 'ण्', '\u0D7B': 'न्', '\u0D7C': 'र्',
        '\u0D7D': 'ल्', '\u0D7E': 'ळ्', '\u0D7F': 'क्'
    };
    for (const script in script_map) {
        for (const character in script_map[script]) {
            input_str = input_str.replaceAll(character, script_map[script][character]);
        }
    }
    return input_str;

}
const walker = document.createTreeWalker(
    document.body,
    NodeFilter.SHOW_TEXT,
    {
        acceptNode: function (node) {
            const parentTag = node.parentElement.tagName.toLowerCase();
            if (parentTag === 'script' || parentTag === 'style') {
                return NodeFilter.FILTER_REJECT;
            }
            return node.textContent.trim() ? NodeFilter.FILTER_ACCEPT : NodeFilter.FILTER_REJECT;
        }
    }
);

while (walker.nextNode()) walker.currentNode.textContent = convert_scripts(walker.currentNode.textContent);